Repository: onronder/DuruNotes
Catalog: lib/l10n/app_*.arb
Languages: es, fr

# notesListTitle
source: My Notes
es: Mis notas
fr: Mes notes

source: Create New Note
es: Crear nota nueva
fr: Créer une nouvelle note

source: Search Notes
es: Buscar en notas
fr: Rechercher dans les notes

source: No notes yet
es: Todavía no hay notas
fr: Aucune note pour le moment

source: Delete Note
es: Eliminar nota
fr: Supprimer la note

source: Cancel
es: Cancelar
fr: Annuler

source: Delete
es: Eliminar
fr: Supprimer

source: Save
es: Guardar
fr: Enregistrer

source: Edit
es: Editar
fr: Modifier

source: Settings
es: Ajustes
fr: Paramètres

source: Language
es: Idioma
fr: Langue

source: Version
es: Versión

source: Note deleted
es: Nota eliminada
fr: Note supprimée

source: Retry
es: Reintentar
fr: Réessayer

source: Syncing...
es: Sincronizando
fr: Synchronisation

source: Sync complete
es: Sincronización completada
fr: Synchronisation terminée

source: Sync failed
es: Error de sincronización
fr: Échec de la synchronisation

source: Sign Out
es: Cerrar sesión
fr: Se déconnecter

source: Welcome back!
es: Bienvenido de nuevo
fr: Bon retour

source: Completed
es: Completado
fr: Terminé

source: Folders
es: Carpetas
fr: Dossiers

source: Folder Name
es: Nombre de la carpeta
fr: Nom du dossier

source: Move to Folder
es: Mover a carpeta
fr: Déplacer vers un dossier

source: Export
es: Exportar
fr: Exporter

source: Import
es: Importar
fr: Importer

source: Export Notes
es: Exportar notas
fr: Exporter les notes

source: Import Notes
es: Importar notas
fr: Importer des notes

source: Yes
es: Sí
fr: Oui

source: Loading…
es: Cargando
fr: Chargement

source: Help
es: Ayuda
fr: Aide

source: Privacy Policy
es: Política de privacidad
fr: Politique de confidentialité

source: Terms of Service
es: Términos de servicio
fr: Conditions d’utilisation

source: Notifications
es: Notificaciones

source: Enable Notifications
es: Activar notificaciones
fr: Activer les notifications

# security
source: Security & Privacy
es: Seguridad
fr: Sécurité

source: Theme
es: Tema
fr: Thème

# lightTheme
source: Light
es: Tema claro
fr: Thème clair

# darkTheme
source: Dark
es: Tema oscuro
fr: Thème sombre

# systemTheme
source: System Default
es: Tema del sistema
fr: Thème du système

# tapToCreateFirstNote
source: Tap + to create your first note
es: Toca + para crear tu primera nota
fr: Touchez + pour créer votre première note

source: Create First Note
es: Crea tu primera nota
fr: Créez votre première note

# logout
source: Sign Out
es: Cerrar sesión
fr: Se déconnecter

# importNotesTitle
source: Import Notes
es: Importar notas
fr: Importer des notes

# exportNotesTitle
source: Export Notes
es: Exportar notas
fr: Exporter des notes

source: Choose what to import:
es: Elige qué quieres importar
fr: Choisissez ce que vous voulez importer

# exportYourNotes
source: Export your notes to various formats:
es: Exporta tus notas
fr: Exportez vos notes

# availableNotes
source: Available notes: {count}
es: Notas disponibles
fr: Notes disponibles

source: Markdown Files
es: Archivos Markdown
fr: Fichiers Markdown

source: Evernote Export
es: Exportación de Evernote
fr: Export Evernote

source: Obsidian Vault
es: Vault de Obsidian
fr: Coffre Obsidian

# importSingleMdFiles
source: Import single .md or .markdown files
es: Importar archivos Markdown individuales
fr: Importer des fichiers Markdown individuels

# importEnexFiles
source: Import .enex files from Evernote
es: Importar archivos ENEX
fr: Importer des fichiers ENEX

# importObsidianVaultFolder
source: Import entire Obsidian vault folder
es: Importar carpeta de vault de Obsidian
fr: Importer un dossier de coffre Obsidian

source: Select Import Type
es: Selecciona el tipo de importación
fr: Sélectionnez le type d’importation

# exportAsMdFiles
source: Export as .md files with full formatting
es: Exportar como archivos Markdown
fr: Exporter en fichiers Markdown

# exportAsPdfDocs
source: Export as PDF documents for sharing
es: Exportar como documentos PDF
fr: Exporter en documents PDF

# exportAsWebPages
source: Export as web pages with styling
es: Exportar como páginas web
fr: Exporter en pages web

source: Select Export Format
es: Selecciona el formato de exportación
fr: Sélectionnez le format d’exportation

source: Choose Format
es: Elige un formato
fr: Choisissez un format

source: Export All Notes
es: Exportar todas las notas
fr: Exporter toutes les notes

source: Export Recent Notes
es: Exportar notas recientes
fr: Exporter les notes récentes

source: Export Latest 10
es: Exportar las últimas 10 notas
fr: Exporter les 10 dernières notes

# exportAllNotesDesc
source: Export all {count} notes
es: Exporta todas las notas de tu cuenta
fr: Exporter toutes les notes de votre compte

# exportRecentNotesDesc
source: Export notes from the last 30 days
es: Exporta las notas creadas y actualizadas recientemente
fr: Exporter les notes récemment créées ou modifiées

# exportLatest10Desc
source: Export the 10 most recent notes
es: Exporta rápidamente solo las últimas 10 notas
fr: Exporter rapidement uniquement les 10 dernières notes

source: Importing Notes
es: Importando notas
fr: Importation des notes

source: Exporting to {format}
es: Exportando notas
fr: Exportation des notes

source: Initializing import...
es: Iniciando importación
fr: Initialisation de l’importation

source: Initializing export...
es: Iniciando exportación
fr: Initialisation de l’exportation

# currentFile
source: File: {filename}
es: Archivo actual
fr: Fichier actuel

# progressCount
source: Progress: {current}/{total}
es: Progreso
fr: Progression

# noteProgress
source: Note: {current}/{total}
es: Progreso de las notas
fr: Progression des notes

# currentNote
source: Current: {title}
es: Nota actual
fr: Note actuelle

source: Overall Progress:
es: Progreso general
fr: Progression globale

# estimatedTimeRemaining
source: Estimated time remaining: {time}
es: Tiempo restante estimado
fr: Temps restant estimé

source: Import Complete
es: Importación completada
fr: Importation terminée

source: Export Complete
es: Exportación completada
fr: Exportation terminée

# successfullyImported
source: ✅ Successfully imported: {count} notes
es: Importado correctamente
fr: Importé avec succès

# successfullyExported
source: ✅ Successfully exported: {count} notes
es: Exportado correctamente
fr: Exporté avec succès

# errorsEncountered
source: ⚠️ Errors encountered: {count}
es: Se encontraron errores
fr: Des erreurs se sont produites

# importTook
source: ⏱️ Import took: {seconds} seconds
es: Duración de la importación
fr: Durée de l’importation

# exportTook
source: ⏱️ Export took: {seconds} seconds
es: Duración de la exportación
fr: Durée de l’exportation

# totalSize
source: 📁 Total size: {size}
es: Tamaño total
fr: Taille totale

source: Error details:
es: Detalles del error
fr: Détails de l’erreur

# filesSavedToDownloads
source: Files saved to Downloads folder
es: Los archivos se han guardado en la carpeta Descargas
fr: Les fichiers ont été enregistrés dans le dossier Téléchargements

source: Failed exports:
es: Exportaciones fallidas
fr: Exportations échouées

source: Share Files
es: Compartir archivos
fr: Partager les fichiers

source: Open Folder
es: Abrir carpeta
fr: Ouvrir le dossier

source: Close
es: Cerrar
fr: Fermer

source: Import Error
es: Error de importación
fr: Erreur d’importation

source: Export Error
es: Error de exportación
fr: Erreur d’exportation

source: No notes to export
es: No hay notas para exportar
fr: Aucune note à exporter

source: Failed to select Markdown files
es: No se pudieron seleccionar los archivos Markdown
fr: Impossible de sélectionner les fichiers Markdown

source: Failed to select Evernote file
es: No se pudo seleccionar el archivo de Evernote
fr: Impossible de sélectionner le fichier Evernote

source: Failed to select Obsidian vault
es: No se pudo seleccionar el vault de Obsidian
fr: Impossible de sélectionner le coffre Obsidian

source: Import failed
es: La importación ha fallado
fr: L’importation a échoué

source: Export failed
es: La exportación ha fallado
fr: L’exportation a échoué

source: Obsidian import failed
es: La importación desde Obsidian ha fallado
fr: L’importation depuis Obsidian a échoué

source: No files available to share
es: No hay archivos disponibles para compartir
fr: Aucun fichier disponible à partager

source: Failed to share exported file
es: No se pudo compartir el archivo exportado
fr: Impossible de partager le fichier exporté

source: Error sharing files
es: Error al compartir los archivos
fr: Erreur lors du partage des fichiers

source: Could not open exports folder
es: No se pudo abrir la carpeta de exportaciones
fr: Impossible d’ouvrir le dossier d’exportation

# pdfExportMayFailInSimulator
source: PDF export may fail in simulator due to network restrictions. Try:
es: La exportación a PDF puede fallar en el simulador
fr: L’exportation PDF peut échouer dans le simulateur

# testOnPhysicalDevice
source: • Test on a physical device
es: Prueba en un dispositivo físico
fr: Testez sur un appareil physique

# checkInternetConnection
source: • Check your internet connection
es: Comprueba tu conexión a Internet
fr: Vérifiez votre connexion Internet

# tryExportingAsMarkdown
source: • Try exporting as Markdown instead
es: Prueba a exportar como Markdown
fr: Essayez d’exporter au format Markdown

# networkRelatedIssueDetected
source: Network-related issue detected. Try:
es: Se detectó un problema relacionado con la red
fr: Un problème réseau a été détecté

# tryAgainInFewMoments
source: • Try again in a few moments
es: Inténtalo de nuevo en unos momentos
fr: Réessayez dans quelques instants

# useDifferentExportFormat
source: • Use a different export format
es: Usa un formato de exportación diferente
fr: Utilisez un autre format d’exportation

source: Try Markdown
es: Prueba el formato Markdown
fr: Essayez le format Markdown

source: Edit Note
es: Editar nota
fr: Modifier la note

source: Untitled
es: Sin título
fr: Sans titre

source: No content
es: Sin contenido
fr: Aucun contenu

source: Just now
es: Justo ahora
fr: À l’instant

# minutesAgo
source: {count} minutes ago
es: hace unos minutos
fr: il y a quelques minutes

# hoursAgo
source: {count} hours ago
es: hace unas horas
fr: il y a quelques heures

# daysAgo
source: {count} days ago
es: hace unos días
fr: il y a quelques jours

# areYouSureDeleteNote
source: Are you sure you want to delete "{title}"?
es: ¿Seguro que quieres eliminar esta nota?
fr: Voulez-vous vraiment supprimer cette note ?

source: Error deleting note
es: Se produjo un error al eliminar la nota
fr: Une erreur s’est produite lors de la suppression de la note

source: Online
es: En línea
fr: En ligne

source: Offline
es: Sin conexión
fr: Hors ligne

source: Error loading notes
es: Se produjo un error al cargar las notas
fr: Une erreur s’est produite lors du chargement des notes

source: Search feature temporarily disabled
es: La función de búsqueda está desactivada temporalmente
fr: La recherche est temporairement désactivée

source: Export functionality coming soon
es: La función de exportación estará disponible pronto
fr: La fonction d’exportation arrive bientôt

source: Settings screen coming soon
es: La pantalla de ajustes estará disponible pronto
fr: L’écran des paramètres arrive bientôt

# areYouSureSignOut
source: Are you sure you want to sign out?
es: ¿Seguro que quieres cerrar sesión?
fr: Voulez-vous vraiment vous déconnecter ?

source: Production-grade import system ready!
es: El sistema de importación de nivel de producción está listo
fr: Le système d’importation de niveau production est prêt

source: Supported formats:
es: Formatos admitidos
fr: Formats pris en charge

# singleMarkdownFiles
source: • Single Markdown files (.md, .markdown)
es: Archivos Markdown individuales
fr: Fichiers Markdown individuels

# evernoteFiles
source: • Evernote export files (.enex)
es: Archivos de Evernote
fr: Fichiers Evernote

source: • Obsidian vault folders
es: Carpetas de vault de Obsidian
fr: Dossiers de coffre Obsidian

# importFeatures
source: Features:
es: Funciones de importación
fr: Fonctionnalités d’importation

source: • Security validation
es: Validación de seguridad
fr: Validation de la sécurité

source: • Progress tracking
es: Seguimiento del progreso
fr: Suivi de progression

source: • Error recovery
es: Recuperación de errores
fr: Récupération après erreur

source: • Content sanitization
es: Limpieza de contenido
fr: Nettoyage du contenu

# featuresSecurityValidation
source: Features: Security validation, progress tracking, error recovery
es: Validación de seguridad y limpieza de contenido
fr: Validation de sécurité et nettoyage du contenu

source: • Export as Markdown files
es: Exportar como archivos Markdown
fr: Exporter en fichiers Markdown

source: • Export as PDF documents
es: Exportar como documentos PDF
fr: Exporter en documents PDF

source: • Export as HTML files
es: Exportar como archivos HTML
fr: Exporter en fichiers HTML

# featuresRichFormatting
source: Features: Rich formatting, metadata, attachments
es: Formato enriquecido y exportación segura
fr: Mise en forme enrichie et exportation sécurisée

source: Export cancelled
es: Exportación cancelada
fr: Exportation annulée

# checkDownloadsFolderForFiles
source: Check your Downloads folder for exported files
es: Revisa la carpeta Descargas para ver los archivos
fr: Vérifiez le dossier Téléchargements pour trouver les fichiers

# filesSavedInAppDocuments
source: Files are saved in app Documents folder. Use "Share Files" to access them.
es: Los archivos se han guardado en la carpeta de documentos de la aplicación
fr: Les fichiers ont été enregistrés dans le dossier Documents de l’application

source: Status: {phase}
es: Estado de la fase
fr: Statut de l’étape

# settingsTitle
source: Settings
es: Ajustes
fr: Paramètres

source: Account
es: Cuenta
fr: Compte

source: Sync
es: Sincronización
fr: Synchronisation

source: Appearance
es: Apariencia
fr: Apparence

source: Import & Export
es: Importar/Exportar
fr: Importer/Exporter

source: Help & About
es: Ayuda y acerca de
fr: Aide et à propos

source: Signed in as
es: Sesión iniciada como
fr: Connecté en tant que

# signOutConfirm
source: Are you sure you want to sign out?
es: ¿Seguro que quieres cerrar sesión?
fr: Voulez-vous vraiment vous déconnecter ?

source: Manage Account
es: Gestionar cuenta
fr: Gérer le compte

source: Sync Mode
es: Modo de sincronización
fr: Mode de synchronisation

# automaticSync
source: Automatic
es: Sincronización automática
fr: Synchronisation automatique

# manualSync
source: Manual
es: Sincronización manual
fr: Synchronisation manuelle

# automaticSyncDesc
source: Sync changes automatically
es: Sincroniza los cambios automáticamente en segundo plano
fr: Synchroniser automatiquement les modifications en arrière-plan

# manualSyncDesc
source: Sync only when requested
es: Sincroniza los datos solo cuando tú lo solicites
fr: Synchroniser les données uniquement lorsque vous le demandez

source: Sync Now
es: Sincronizar ahora
fr: Synchroniser maintenant

source: Accent Color
es: Color de acento
fr: Couleur d’accent

source: Select Language
es: Seleccionar idioma
fr: Sélectionner une langue

source: English
es: Inglés
fr: Anglais

# turkish
source: Türkçe
es: Turco
fr: Turc

source: Open System Settings
es: Abrir configuración del sistema
fr: Ouvrir les paramètres système

source: Notification Permissions
es: Permisos de notificación
fr: Autorisations de notification

source: End-to-End Encryption
es: Cifrado de extremo a extremo
fr: Chiffrement de bout en bout

# encryptionEnabled
source: Your notes are encrypted with industry-standard encryption
es: Cifrado activado
fr: Chiffrement activé

# analyticsOptIn
source: Usage Analytics
es: Participar en analíticas
fr: Participer aux statistiques

# analyticsDesc
source: Help improve the app by sharing anonymous usage data
es: Comparte datos de uso anónimos para ayudar a mejorar la aplicación
fr: Partagez des données d’utilisation anonymes pour aider à améliorer l’application

source: Biometric Lock
es: Bloqueo biométrico
fr: Verrouillage biométrique

# biometricDesc
source: Require biometric authentication to open the app
es: Usa huella dactilar o reconocimiento facial para acceder a las notas
fr: Utilisez l’empreinte digitale ou la reconnaissance faciale pour accéder aux notes

# biometricNotAvailable
source: Biometric authentication not available
es: La autenticación biométrica no está disponible en este dispositivo
fr: L’authentification biométrique n’est pas disponible sur cet appareil

source: Build Number
es: Número de compilación
fr: Numéro de build

source: Contact Support
es: Contactar con soporte
fr: Contacter le support

source: Rate App
es: Valorar la aplicación
fr: Noter l’application

source: User Guide
es: Guía de usuario
fr: Guide d’utilisation

# helpAndSupport
source: Help & Support
es: Ayuda y soporte
fr: Aide et support

source: Documentation
es: Documentación

source: About App
es: Acerca de la aplicación
fr: À propos de l’application

source: Shared Note
es: Nota compartida
fr: Note partagée

source: Shared Text
es: Texto compartido
fr: Texte partagé

source: Shared Image
es: Imagen compartida
fr: Image partagée

source: Shared Link
es: Enlace compartido
fr: Lien partagé

source: Shared File
es: Archivo compartido
fr: Fichier partagé

# sharedFrom
source: Shared from {source} on {date}
es: Compartido desde
fr: Partagé depuis

source: Shared image could not be processed.
es: No se pudo procesar la imagen compartida
fr: L’image partagée n’a pas pu être traitée

# folderPickerTitle
source: Choose Folder
es: Selecciona una carpeta
fr: Choisissez un dossier

# folderPickerSubtitle
source: Organize your note
es: Elige una carpeta para mover la nota
fr: Sélectionnez un dossier pour déplacer la note

source: Create New Folder
es: Crear nueva carpeta
fr: Créer un nouveau dossier

# createNewFolderSubtitle
source: Add a new folder for organization
es: Añade una carpeta nueva para organizar tus notas
fr: Ajoutez un nouveau dossier pour organiser vos notes

# folderNameHint
source: e.g., Work, Personal, Ideas
es: Nombre de la carpeta
fr: Nom du dossier

# folderNameRequired
source: Folder name is required
es: El nombre de la carpeta es obligatorio
fr: Le nom du dossier est obligatoire

# folderColor
source: Color
es: Color de la carpeta
fr: Couleur du dossier

# folderIcon
source: Icon
es: Icono de la carpeta
fr: Icône du dossier

source: Parent Folder
es: Carpeta padre
fr: Dossier parent

source: Root Level
es: Nivel raíz
fr: Niveau racine

source: Description
es: Descripción

source: Optional
es: Opcional
fr: Facultatif

# folderDescriptionHint
source: Brief description of this folder's purpose
es: Descripción opcional para la carpeta
fr: Description facultative du dossier

source: Select Parent Folder
es: Selecciona la carpeta padre
fr: Sélectionnez le dossier parent

source: Unfiled Notes
es: Notas sin carpeta
fr: Notes sans dossier

# noteCount
source: {count, plural, =0{No notes} =1{1 note} other{{count} notes}}
es: Número de notas
fr: Nombre de notes

source: Search folders...
es: Buscar en carpetas
fr: Rechercher dans les dossiers

source: Show search
es: Mostrar búsqueda
fr: Afficher la recherche

source: Hide search
es: Ocultar búsqueda
fr: Masquer la recherche

source: Clear search
es: Limpiar búsqueda
fr: Effacer la recherche

source: No folders found
es: No se encontraron carpetas
fr: Aucun dossier trouvé

# noFoldersFoundSubtitle
source: No folders match '{query}'
es: Prueba cambiando el filtro o crea una nueva carpeta
fr: Essayez de modifier le filtre ou créez un nouveau dossier

# loadFoldersError
source: Failed to load folders
es: Se produjo un error al cargar las carpetas
fr: Erreur lors du chargement des dossiers

source: Create
es: Crear
fr: Créer

source: Load error
es: Error de carga
fr: Erreur de chargement

source: Folder Management
es: Gestión de carpetas
fr: Gestion des dossiers

source: Edit Folder
es: Editar carpeta
fr: Modifier le dossier

source: Delete Folder
es: Eliminar carpeta
fr: Supprimer le dossier

source: Move Folder
es: Mover carpeta
fr: Déplacer le dossier

source: Folder Properties
es: Propiedades de la carpeta
fr: Propriétés du dossier

# confirmDeleteFolder
source: Delete this folder?
es: Confirmar eliminación de carpeta
fr: Confirmer la suppression du dossier

# confirmDeleteFolderMessage
source: This will move all notes and subfolders to the parent level.
es: Esta carpeta y su contenido se eliminarán de forma permanente. ¿Quieres continuar?
fr: Ce dossier et son contenu seront définitivement supprimés. Voulez-vous continuer ?

# confirmDeleteFolderAction
source: Delete Folder
es: Eliminar carpeta
fr: Supprimer le dossier

source: Add to Folder
es: Añadir a carpeta
fr: Ajouter au dossier

source: Remove from Folder
es: Quitar de la carpeta
fr: Retirer du dossier

# folderEmpty
source: This folder is empty
es: La carpeta está vacía
fr: Le dossier est vide

# folderEmptySubtitle
source: Add notes to get started
es: Usa el icono + para añadir notas aquí o mueve notas a esta carpeta
fr: Utilisez l’icône + pour ajouter des notes ici ou déplacez des notes dans ce dossier

source: All Folders
es: Todas las carpetas
fr: Tous les dossiers

source: Expand All
es: Expandir todo
fr: Tout développer

source: Collapse All
es: Contraer todo
fr: Tout réduire

source: Done
es: Listo
fr: Terminé

source: OK
es: Aceptar

# continueAction
source: Continue
es: Continuar
fr: Continuer

source: Back
es: Atrás
fr: Retour

source: Next
es: Siguiente
fr: Suivant

source: Finish
es: Finalizar
fr: Terminer

source: Select Files
es: Seleccionar archivos
fr: Sélectionner des fichiers

source: Selecting files
es: Seleccionando archivos
fr: Sélection des fichiers

source: Scanning directory
es: Escaneando carpeta
fr: Analyse du dossier

source: Reading file
es: Leyendo archivo
fr: Lecture du fichier

source: Parsing content
es: Analizando contenido
fr: Analyse du contenu

source: Converting to blocks
es: Convirtiendo a bloques
fr: Conversion en blocs

source: Processing files
es: Procesando archivos
fr: Traitement des fichiers

source: Saving notes
es: Guardando notas
fr: Enregistrement des notes

source: Preparing
es: Preparando
fr: Préparation

source: Rendering
es: Renderizando
fr: Rendu en cours

source: Finalizing
es: Finalizando
fr: Finalisation

source: No
fr: Non
